mrsgit09Docset0516221715/articles/MS-SSAS/d02d01d3-478e-4a77-ba9d-4f56f7ecf337.md

<html dir="LTR" xmlns:mshelp="http://msdn.microsoft.com/mshelp" xmlns:ddue="http://ddue.schemas.microsoft.com/authoring/2003/5" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:tool="http://www.microsoft.com/tooltip">
    <head>
        <meta http-equiv="Content-Type" content="text/html; CHARSET=utf-8"></meta>
        <meta name="save" content="history"></meta>
        <title>4.2.4 End of Session</title>
        <xml>
            <mshelp:toctitle title="4.2.4 End of Session"></mshelp:toctitle>
            <mshelp:rltitle title="[MS-SSAS]: End of Session"></mshelp:rltitle>
            <mshelp:keyword index="A" term="d02d01d3-478e-4a77-ba9d-4f56f7ecf337"></mshelp:keyword>
            <mshelp:attr name="DCSext.ContentType" value="open specification"></mshelp:attr>
            <mshelp:attr name="AssetID" value="d02d01d3-478e-4a77-ba9d-4f56f7ecf337"></mshelp:attr>
            <mshelp:attr name="TopicType" value="kbRef"></mshelp:attr>
            <mshelp:attr name="DCSext.Title" value="[MS-SSAS]: End of Session" />
        </xml>
    </head>
    <body>
        <div id="header">
            <h1 class="heading">4.2.4 End of Session</h1>
        </div>
        <div id="mainSection">
            <div id="mainBody">
                <div id="allHistory" class="saveHistory"></div>
                <div id="sectionSection0" class="section" name="collapseableSection">
                    

<p>The client sends a header of the request to end this
session:</p>

<dl>
<dd>
<div><pre> POST /as/msmdpump.dll HTTP/1.1
 User-Agent: XmlaClient
 Content-Type: text/xml
 SOAPAction: &quot;urn:schemas-microsoft-com:xml-analysis:Execute&quot;
 X-Transport-Caps-Negotiation-Flags: 1,0,0,0,0
 Host: testserver:2390
 Content-Length: 596
 Expect: 100-continue
</pre></div>
</dd></dl>

<p>The server responds with a confirmation:</p>

<dl>
<dd>
<div><pre> HTTP/1.1 100 Continue
</pre></div>
</dd></dl>

<p>The client sends the payload portion of the request:</p>

<dl>
<dd>
<div><pre> &lt;Envelope xmlns=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
   &lt;Header&gt;
     &lt;EndSession soap:mustUnderstand=&quot;1&quot; SessionId=&quot;537C61C6-827C-4305-83A6-C8CE4A91001B&quot; xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns=&quot;urn:schemas-microsoft-com:xml-analysis&quot; /&gt;
   &lt;/Header&gt;
   &lt;Body&gt;
     &lt;Execute xmlns=&quot;urn:schemas-microsoft-com:xml-analysis&quot;&gt;
       &lt;Command&gt;
         &lt;Statement /&gt;
       &lt;/Command&gt;
       &lt;Properties&gt;
         &lt;PropertyList&gt;
           &lt;LocaleIdentifier&gt;1033&lt;/LocaleIdentifier&gt;
         &lt;/PropertyList&gt;
       &lt;/Properties&gt;
     &lt;/Execute&gt;
   &lt;/Body&gt;
 &lt;/Envelope&gt;
</pre></div>
</dd></dl>

<p>The server responds with a confirmation:</p>

<dl>
<dd>
<div><pre> HTTP/1.1 200 OK
 Date: Sat, 16 Feb 2008 00:30:35 GMT
 Server: Microsoft-IIS/6.0
 X-Powered-By: ASP.NET
 Transfer-Encoding: chunked
 X-Transport-Caps-Negotiation-Flags: 0,0,0,0,0
 Content-Type: text/xml
 10c
 &lt;soap:Envelope xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
   &lt;soap:Body&gt;
     &lt;ExecuteResponse xmlns=&quot;urn:schemas-microsoft-com:xml-analysis&quot;&gt;
       &lt;return&gt;
         &lt;root xmlns=&quot;urn:schemas-microsoft-com:xml-analysis:empty&quot;/&gt;
       &lt;/return&gt;
     &lt;/ExecuteResponse&gt;
   &lt;/soap:Body&gt;
 &lt;/soap:Envelope&gt;
 0
</pre></div>
</dd></dl>

<p>The client closes the connection.</p>


                </div>
            </div>
        </div>
    </body>
</html>